app/controllers/questions_controller.rb

	def edit
		@question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1

	def create

		#render plain: params[:question].inspect
		@question = Question.new(question_params)

		if @question.save
---
INSERT INTO `questions` (`question`, `op1`, `op2`, `op3`, `op4`, `correct`, `created_at`, `updated_at`) VALUES ('jcjdssd', 'ffdsd', 's', 'a', 'd', 4, '2016-10-09 09:19:21', '2016-10-09 09:19:21')

	def destroy
		@question = Question.find(params[:id])
		@question.destroy
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 3

	def update
  		@question = Question.find(params[:id])

  		if @question.update(question_params)
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1
UPDATE `questions` SET `op4` = 'ddnbn', `updated_at` = '2016-10-09 10:02:34' WHERE `questions`.`id` = 3

	def show
		puts '-------------'
		puts params.inspect
		@question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1