app/controllers/users_controller.rb

	def save_user
		@user = ""
		if user_save_params.present?
			# User.create(user_save_params)
			@user = User.new
			@user.first_name = user_save_params[:first_name]
			@user.last_name = user_save_params[:last_name]
			@user.date_of_birth = user_save_params[:date_of_birth]
			@user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `date_of_birth`, `created_at`, `updated_at`) VALUES ('ISHWAR', 'KUMAR', '2016-10-12', '2016-10-12 10:05:36', '2016-10-12 10:05:36')

	def take_test
		@questions = Question.all
		@question_count = @questions.count
		@users = User.all
---
SELECT `questions`.* FROM `questions`
SELECT COUNT(*) FROM `questions`
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` DESC LIMIT 1

	def submit_test

		#puts 'params',params.inspect
		#Answer.create(user_save_params)
		#render plain: params[input_values].inspect

		@input_values=params[:input_values]

		@user_id = params[:user_id]
		#this is for destroying the table entries of the previous user
		Answer.where(user_id: @user_id).destroy_all

		@input_values.each  do |k,v|
			@answer = Answer.new
			@answer.user_id = @user_id
			@answer.question_id = k
			@answer.input_answer = v
			@answer.save
		end
		@questions = Question.all
		total_question= @questions.count
		count = 0
		@all_answer = Answer.where(:user_id => @user_id)
		@all_answer.each do |answer|
		end
		for i in 1..total_question
			@question = Question.find_by_id i
			@answer = @all_answer.find_by_question_id i
---
DELETE FROM `answers` WHERE `answers`.`id` = 61
SELECT  `answers`.* FROM `answers` WHERE `answers`.`user_id` = 3 LIMIT 1
INSERT INTO `answers` (`user_id`, `question_id`, `input_answer`, `created_at`, `updated_at`) VALUES (1, 1, 1, '2016-10-14 10:39:28', '2016-10-14 10:39:28')
SELECT  `questions`.* FROM `questions`  ORDER BY `questions`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `questions`
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` IN (NULL, NULL)
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
SELECT  `answers`.* FROM `answers` WHERE `answers`.`user_id` = 5 AND `answers`.`question_id` = 0 LIMIT 1